ci_project/app/Controllers/Home.php

    public function index(): string
    {
        try {
            $db = db_connect();
            $db->initialize();
            if ($db->connID) {
                echo "Connected to Database, ";
                print_r($db->getDatabase());
                echo '<br />';
            }


            //$students = $db->table('students');

            $studentAll = $this->studentModel->findAll();
            $courseAll = $this->courseModel->findAll();
            $studentById = $this->studentModel->find(1);
---
SELECT *
FROM "students"
SELECT *
FROM "courses"
SELECT *
FROM "students"
WHERE "students"."id" = 1